{
    "status": "ok",
    "totalResults": 3,
    "articles": [
        {
            "source": {
                "id": "espn-cric-info",
                "name": "ESPN Cric Info"
            },
            "author": null,
            "title": "PCB hands Umar Akmal three-year ban from all cricket | ESPNcricinfo.com",
            "description": "Penalty after the batsman pleaded guilty to not reporting corrupt approaches | ESPNcricinfo.com",
            "url": "http://www.espncricinfo.com/story/_/id/29103103/pcb-hands-umar-akmal-three-year-ban-all-cricket",
            "urlToImage": "https://a4.espncdn.com/combiner/i?img=%2Fi%2Fcricket%2Fcricinfo%2F1099495_800x450.jpg",
            "publishedAt": "2020-04-27T11:41:47Z",
            "content": "Umar Akmal's troubled cricket career has hit its biggest roadblock yet, with the PCB handing him a ban from all representative cricket for three years after he pleaded guilty of failing to report det… [+1506 chars]"
        },
        {
            "source": {
                "id": "espn-cric-info",
                "name": "ESPN Cric Info"
            },
            "author": null,
            "title": "What we learned from watching the 1992 World Cup final in full again | ESPNcricinfo.com",
            "description": "Wides, lbw calls, swing - plenty of things were different in white-ball cricket back then | ESPNcricinfo.com",
            "url": "http://www.espncricinfo.com/story/_/id/28970907/learned-watching-1992-world-cup-final-full-again",
            "urlToImage": "https://a4.espncdn.com/combiner/i?img=%2Fi%2Fcricket%2Fcricinfo%2F1219926_1296x729.jpg",
            "publishedAt": "2020-03-30T15:26:05Z",
            "content": "Last week, we at ESPNcricinfo did something we have been thinking of doing for eight years now: pretend-live ball-by-ball commentary for a classic cricket match. We knew the result, yes, but we tried… [+6823 chars]"
        },
        {
            "source":{
                "id": "espn-cric-info",
                "name":"ESPN Cric Info"
            },
            "author": null,
            "title": "Moeen Ali recalled for Ashes after agreeing Test comeback",
            "description": "Moeen Ali has reversed his retirement from Test cricket and been added to England's Ashes squad after answering an SOS call from the team's management.",
            "url": "https://www.espncricinfo.com/story/moeen-ali-recalled-england-ashes-test-comeback-1380187",
            "urlToImage": "https://img1.hscicdn.com/image/upload/f_auto,t_ds_w_1280,q_70/lsci/db/PICTURES/CMS/325600/325680.4.jpg",
            "publishedAt": "2023-06-07T14:20:02Z",
            "content": "Moeen confirmed to ESPNcricinfo on Monday night that he had been asked to consider a potential call-up following an injury to Jack Leach, who went for scans after England's 10-wicket win over Ireland at Lord's which revealed a lower-back stress fracture. He held discussions with Ben Stokes, Brendon McCullum and Rob Key - England's captain, coach and managing director respectively - and the ECB announced on Wednesday morning that Moeen has agreed to return to Test cricket. He has been added to England's squad for the first two Ashes Tests at Edgbaston and Lord's. We reached out to Mo early this week about returning to Test cricket, Key said. Having had a couple of days to reflect, Mo is excited to join the squad and play Test cricket again. His vast experience, along with his all-round ability, will benefit our Ashes campaign. We wish Mo and the rest of the squad well for the Ashes campaign. The other main contenders to fill the vacancy created by Leach's injury were Rehan Ahmed and Will Jacks - who both took Test five-wicket hauls in Pakistan in December - and Liam Dawson, who represented a like-for-like replacement as a left-arm spinner."
        }
    ]
}